{
	"_meta": {
		"sources": [
			{
				"json": "NessusaryEvils",
				"abbreviation": "NE",
				"full": "Nessus-ary Evils",
				"authors": [
					"Genuine Fantasy Press",
					"apotheosis"
				],
				"convertedBy": [
					"apotheosis"
				],
				"version": "1.0",
				"url": "https://www.reddit.com/r/UnearthedArcana/comments/939c4v/genuine_the_compendium_of_forgotten_secrets/",
				"targetSchema": "1.1.0"
			}
		],
		"dateAdded": 1582296841,
		"dateLastModified": 1582296841
	},
	"variantrule": [
		{
			"name": "Alternative Spellcasting Abilities",
			"entries": [
				"If you can give me a good argument for it, you may swap out your default spellcasting ability (Charisma for Bards, Paladins, Sorcerers; Intelligence for Artificers, Warlocks, and Wizards; or Wisdom for Clerics, Druids, and Rangers) for a different spellcasting ability. However, you can only choose mental stats for the purposes of this swap."
			],
			"source": "NE"
		},
		{
			"name": "Character Creation",
			"entries": [
				"Rather than gaining ability score increases based on your character's race, you may use the following method: You gain +1 ability score increase from your class and two +1 ability score increases from your background.",
				{
							"type": "table",
							"caption": "Ability Score Increases",
							"colLabels": [
								"Class",
								"Ability Scorce Increase"
							],
							"colStyles": [
								"col-13",
								"col-13"
							],
							"rows": [
								[
									"Artificer",
									"+1 Intelligence"
								],
								[
									"Barbarian",
									"+1 Constitution"
								],
								[
									"Bard",
									"+1 Charisma"
								],
								[
									"Cleric",
									"+1 Wisdom"
								],
								[
									"Druid",
									"+1 Wisdom"
								],
								[
									"Fighter",
									"+1 Strength"
								],
								[
									"Monk",
									"+1 Constitution"
								],
								[
									"Paladin",
									"+1 Strength"
								],
								[
									"Ranger",
									"+1 Dexterity"
								],
								[
									"Rogue",
									"+1 Dexterity"
								],
								[
									"Sorcerer",
									"+1 Charisma"
								],
								[
									"Warlock",
									"+1 Intelligence"
								],
								[
									"Wizard",
									"+1 Intelligence"
								]
							]
						},
			],
			"source": "NE"
		},
		{
			"name": "Mystic Arcana",
			"entries": [
				"The warlock's mystic arcana feature follows the rules for the Magical Secrets feature from the bard class. This means that, for the appropriate level of the arcanum (6th, 7th, 8th, or 9th), you may choose a spell from any class list, rather than only spells from the warlock spell list."
			],
			"source": "NE"
		},
		{
			"name": "Potions",
			"entries": [
				"You can use a bonus action to administer a potion to yourself or to another character within 5 feet of you."
			],
			"source": "NE"
		},
		{
			"name": "Resurrection",
			"entries": [
				"If a character is dead, and a resurrection is attempted by a spell or spell effect with longer than a 1 action casting time, a resurrection challenge is initiated. Up to 3 members of the adventuring party can offer to contribute to the ritual. The DM asks them each to make a skill check based on their form of contribution. For example, praying to the god of the fallen character may require an Intelligence (Religion) check at an easy to medium difficulty, where loudly demanding the soul of the fallen to return from the aether may require a Charisma (Intimidation) check at a very hard or nearly impossible difficulty. After all contributions are completed, the DM then rolls a single, final resurrection check with no modifier. The base DC for the final resurrection check is 10, increasing by 1 for each previous successful resurrection the character has undergone (signifying the slow erosion of the soul’s connection to this world). For each successful contribution skill check, this DC is decreased by 3, whereas each failed contribution skill check increases the DC by 1. Upon a successful resurrection check, the player’s soul (should it be willing) will be returned to the body and the ritual succeeds. On a failed check, the soul does not return and the character is lost. Only the strongest of magical incantations can bypass this resurrection challenge, in the form of the True Resurrection or Wish spells. These spells can also restore a character to life who was lost due to a failed resurrection ritual. Additionally, a single spellcaster can only perform a resurrection spell above Revivify on another character once. For example, if a character casts Raise Dead on another character, they cannot resurrect them again by any means other than True Resurrection or Wish."
			],
			"source": "NE"
		},
		{
			"name": "Spell Scrolls",
			"entries": [
				"A spell scroll bears the words of a single spell, written as a mystical cipher. If you are a member of a class with a Pact Magic or Spellcasting feature (heretofore referred to as a spellcaster), you can read the scroll and cast its spell without having to provide any of the spell's components. Casting the spell by reading the scroll requires the spell's normal casting time. If the spell is of a higher level than you can normally cast or if you are not a spellcaster, you must make an ability check using your spellcasting ability to determine whether you cast it successfully. If you are not a spellcaster, you use the ability appropriate to one of the classes to which the spell is available to make this check. In cases where a spell is on, for example, the Cleric spell list and the Wizard spell list, you may choose which ability you use to cast the spell. The DC corresponds to 10 + the spell's level. On a failed check, the spell disappears from the scroll with no other effect. Once the spell is cast, the words on the scroll fade, and the scroll itself crumbles to dust."
			],
			"source": "NE"
		},
		{
			"name": "Skill Checks: Help and Tools",
			"entries": [
				"When making an ability check outside of combat, an ally with proficiency in the relevant skill or background-related knowledge of something (ie. a character who is a cleric or warlock of a particular being counts as having background-related knowledge for a History or Religion check on its followers or practices, even if they don't have proficiency) can help, giving you advantage on the check. In combat, you cannot help another character with an ability check, unless you are in adjacent spaces. Grapple checks and similar are exempt from this rule and cannot benefit from help. If you have a relevant tool proficiency, such as forgery kit proficiency when forging a document, you may add your proficiency bonus to the roll. If you would already add your proficiency bonus to the roll, you instead gain advantage on the roll."
			],
			"source": "NE"
		}
	]
}