{
	"_meta": {
		"sources": [{
			"json": "walrockwitch",
			"abbreviation": "WH",
			"full": "Witch (WH)",
			"authors": [
				"Walrock Homebrew"
			],
			"convertedBy": [
				"apotheosis"
			],
			"version": "1.2",
			"color": "#800080",
			"url": "https://www.dmsguild.com/product/248189/WH-The-Witch-a-character-class-of-natural-arcana-and-the-old-ways-of-magic",
			"targetSchema": "1.0.0"
		}],
		"dateAdded": 1546170412,
		"dateLastModified": 1546170412
	},
	"class": [{
			"name": "Witch",
			"source": "walrockwitch",
			"hd": {
				"number": 1,
				"faces": 6
			},
			"proficiency": [
				"int",
				"wis"
			],
			"classTableGroups": [{
					"colLabels": [
						"Jinxes Known"
					],
					"rows": [
						[
							0
						],
						[
							0
						],
						[
							1
						],
						[
							1
						],
						[
							2
						],
						[
							2
						],
						[
							2
						],
						[
							2
						],
						[
							3
						],
						[
							3
						],
						[
							3
						],
						[
							3
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							4
						],
						[
							5
						],
						[
							5
						],
						[
							5
						],
						[
							5
						]
					]
				},
				{
					"colLabels": [
						"{@filter Cantrips Known|spells|level=0|class=Witch (WH)}",
						"Spells Known"
					],
					"rows": [
						[
							3,
							3
						],
						[
							3,
							4
						],
						[
							3,
							5
						],
						[
							4,
							6
						],
						[
							4,
							7
						],
						[
							4,
							8
						],
						[
							4,
							9
						],
						[
							4,
							10
						],
						[
							4,
							11
						],
						[
							5,
							12
						],
						[
							5,
							13
						],
						[
							5,
							14
						],
						[
							5,
							15
						],
						[
							5,
							16
						],
						[
							5,
							17
						],
						[
							5,
							18
						],
						[
							5,
							19
						],
						[
							5,
							19
						],
						[
							5,
							20
						],
						[
							5,
							20
						]
					]
				},
				{
					"title": "Spell Slots per Spell Level",
					"colLabels": [
						"{@filter 1st|spells|level=1|class=Witch (WH)}",
						"{@filter 2nd|spells|level=2|class=Witch (WH)}",
						"{@filter 3rd|spells|level=3|class=Witch (WH)}",
						"{@filter 4th|spells|level=4|class=Witch (WH)}",
						"{@filter 5th|spells|level=5|class=Witch (WH)}",
						"{@filter 6th|spells|level=6|class=Witch (WH)}",
						"{@filter 7th|spells|level=7|class=Witch (WH)}",
						"{@filter 8th|spells|level=8|class=Witch (WH)}",
						"{@filter 9th|spells|level=9|class=Witch (WH)}"
					],
					"rows": [
						[
							2,
							0,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							3,
							0,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							2,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							0,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							2,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							0,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							1,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							2,
							0,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							1,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							0,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							0,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							0,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							0
						],
						[
							4,
							3,
							3,
							3,
							2,
							1,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							1,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							2,
							1,
							1,
							1
						],
						[
							4,
							3,
							3,
							3,
							3,
							2,
							2,
							1,
							1
						]
					]
				}
			],
			"startingProficiencies": {
				"armor": [
					"none"
				],
				"weapons": [
					"blowguns",
					"daggers",
					"quarterstaffs",
					"sickles"
				],
				"tools": [
					"alchemist's supplies", "herbalism kit", "poisoner's kit"
				],
				"skills": [{
					"choose": {
						"from": [
							"animal handling",
							"arcana",
							"history",
							"insight",
							"medicine",
							"nature",
							"religion",
							"stealth",
							"survival"
						],
						"count": 2
					}
				}]
			},
			"startingEquipment": {
				"additionalFromBackground": true,
				"default": [
					"(a) a dagger or (b) a sickle",
					"(a) a component pouch or (b) an arcane focus or (c) a druidic focus",
					"a set of alchemist's supplies, an herbalism kit, and a poisoner's kit",
					"(a) an scholar's pack or (b) a explorer's pack",
					"a spellbook"
				],
				"goldAlternative": "2d4 x 10"
			},
			"classFeatures": [
				[{
						"name": "Spellcasting",
						"entries": [{
								"type": "entries",
								"name": "Cantrips",
								"entries": [
									"At 1st level, you know three cantrips of your choice from the witch spell list. You learn additional witch cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Witch table."
								]
							},
							{
								"type": "entries",
								"name": "Spell Slots",
								"entries": [
									"The Witch table shows how many spell slots you have to cast your witch spells of 1st level and higher. To cast one of these witch spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. For example, if you know the 1st-level spell witch bolt and have a 1st-level and a 2nd-level spell slot available, you can cast witch bolt using either slot."
								]
							},
							{
								"type": "entries",
								"name": "Spells Known of 1st Level or Higher",
								"entries": [
									"You know three 1st-level spells of your choice from the witch spell list. You learn an additional witch spell of your choice at each level. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st- or 2nd-level. Additionally, when you gain a level in this class, you can choose one of the witch spells you know and replace it with another spell from the witch spell list, which also must be of a level for which you have spell slots."
								]
							},
							{
								"type": "entries",
								"name": "Spellcasting Ability",
								"entries": [
									"Intelligence is your spellcasting ability for witch spells, representing the deep study of natural arcana required for witchcraft. You use Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a witch spell you cast and when making an attack roll with one.",
									{
										"type": "abilityDc",
										"name": "Spell",
										"attributes": [
											"int"
										]
									},
									{
										"type": "abilityAttackMod",
										"name": "Spell",
										"attributes": [
											"int"
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Ritual Book",
								"entries": [
									"You also have a spellbook known as a ritual book. Your ritual book does not contain the witch spells you know, which are instead fixed in your memory. Rather, the ritual book contains your choice of two 1st-level spells that have the ritual tag from the witch spell list. The spells that are in your ritual book don’t count against the number of spells you know. You can’t cast the witch spells in your ritual book except as rituals, unless you’ve learned them by some other means. You can also cast any witch spell you know as a ritual if it has the ritual tag.",
									{
										"type": "entries",
										"name": "Adding Ritual Spells",
										"entries": ["On your adventures, you can add other witch ritual spells to your ritual book. When you find such a spell, you can add it to your ritual book if the spell’s level is equal to or less than half your witch level (rounded up) and if you can spare the time to tran scribe the spell. For each level of the spell, the transcrip tion process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it."]
									},
									{
										"type": "entries",
										"name": "Replacing the Book",
										"entries": ["You can copy a ritual spell from your ritual book into another book — for example, if you want to make a backup copy of your ritual book. This is just like copying a new ritual spell into your ritual book, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied ritual spell.",
											"If you lose your ritual book and do not have a replacement, you can instead attempt to replicate each ritual spell in the lost book, writing each spell in turn into a new book. This has the same cost in time and currency as duplicating a book, above, but after scribing a spell you must roll an Intelligence (Arcana) check with a DC of 8 + twice the ritual spell’s level, to determine whether or not you have recalled it correctly. On a success, the ritual spell is added to your book, but on a failure the spell is incorrect and forgotten, and must be found again. To avoid this, most witches keep an extra ritual book hidden away in a secure location."
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Spellcasting Focus",
								"entries": [
									"You can use an arcane focus or a druidic focus as a spellcasting focus for your witch spells."
								]
							}
						]
					},
					{
						"name": "Occult Familiar",
						"entries": [
							"Since time immemorial, witches have formed bonds with familiar spirits, which stand as symbols and sources of their magical power. Historically, familiars have acted as messengers between witches and the unknowable entities that taught them the ways of the arcane, but in modern times familiars mostly serve as companions and foils to their chosen witch.",
							"You know the spell {@spell find familiar}, which counts as a witch spell and does not count against the total spells you can know. You are able to cast find familiar without expending a spell slot or any materials costs. Familiars you conjure with find familiar gain a number of additional benefits:",
							{
								"type": "list",
								"items": [
									"The familiar’s Charisma and Intelligence scores become 12, unless they are already higher.",
									"The familiar can speak, read, and understand all languages you know.",
									"The familiar’s movement does not provoke opportunity attacks.",
									"The familiar adds your witch level to its hit point maximum.",
									"If the familiar succeeds on a saving throw and would take half damage, it instead takes no damage."
								]
							}
						]
					}
				],
				[{
						"name": "Jinx",
						"entries": [
							"At 2nd level, you harness the power of jinxes, which are subtle ways to twist your spellcraft, derived from the blending of natural and arcane magics. Learn two jinxes of your choice from the following list. You learn one additional jinx of your choice at 7th, 13th, and 18th level.",
							"Once on each of your turns in which a creature within 120 feet of you that you can see has failed a saving throw against one of your spells or has been hit by one of your attacks, you can use a bonus action to target one such creature of your choice with a jinx of your choice, out of those jinxes that you know. If multiple such crea- tures exist, still target only one of them. A jinx’s effects last until the start of your next turn, unless the effects would end earlier. Jinxes are inherently magical, and do not function in the area of an antimagic field spell or similar effects.",
							"You can use this feature once before you must finish a short or long rest to regain its usage. At 5th level, you can use this feature twice between rests. At 15th, this increases to three times between rests.",
							"The jinxes you can learn can be found on the {@filter Optional Features page|optionalfeatures|feature_type=jinx}. If a jinx has prerequisites, you must meet them before you can learn the jinx. Whenever you gain a witch level, you can replace one jinx you know with a different jinx on this list that you meet the prerequisites for."
							]
					},
					{
						"name": "Witch's Coven",
						"entries": [
							"Also at 2nd level, you align yourself with a Witch's Coven, a secretive society of witches that closely guards their magical secrets from the outside."
						],
						"gainSubclassFeature": true
					}
				],
				[{
						"name": "Brewcraft",
						"entries": [
							"Natural magic and arcane magic are not separate entities to a witch. Because of this, witches are masters of unlocking the arcane potential hidden in common herbs and plants. Starting at 3rd level, if you craft a magic item in the potion category, it takes you a quarter of the normal time, and it costs you half as much of the usual gold. These bonuses also apply to any mundane items you could create with alchemist’s supplies or the poisoner’s kit, such as antitoxin, acid, alchemist’s fire, ale, basic poison, or any of the poisons listed in the Dungeon Master’s Guide.",
							"Your DM may decide that certain potions or poisons (purple worm poison, as an example) are uncraftable to you unless you uncover specific rare ingredients first. Should you acquire them, subtract the price of these rare ingredients from the crafting cost accordingly."
						]
					},
					{
						"name": "Imbue Potion",
						"entries": [
							"When witches are unable to spend great amounts of time brewing potions, they can imbue a tincture directly with their arcane power. The result is a potion that is easier and less costly to make, but less stable and with little longevity.",
							"Beginning at 3rd level, when you take a short or long rest and have an empty vial on your person, you can choose one of the following spells you know and can cast with available spell slots:",
							{
								"type": "table",
								"caption": "Imbue Potion",
								"colLabels": [
									"Spell Level",
									"Spells"
								],
								"colStyles": [
									"col3 textcenter",
									"col9"
								],
								"rows": [
									[
										"1st",
										"{@spell animate hair|WH}, {@spell charm person}, {@spell command}, {@spell cure wounds}, {@spell disguise self}, {@spell detect magic}, {@spell false life}, {@spell feather fall}, {@spell mage armor}, {@spell sleep}, {@spell speak with animals}"
									],
									[
										"2nd",
										"{@spell alter self}, {@spell barkskin}, {@spell blindness/deafness}, {@spell detect thoughts}, {@spell dragon's breath|XGE}, {@spell enhance ability}, {@spell enlarge/reduce}, {@spell invisibility}, {@spell lesster restoration}, {@spell protection from poison}, {@spell see invisibilty}, {@spell spider climb}"
									],
									[
										"3rd",
										"{@spell catnap|XGE}, {@spell dispel magic}, {@spell feign death}, {@spell gaseous form}, {@spell nondetection}, {@spell protection from energy}, {@spell remove curse}, {@spell revivify}, {@spell tongues}, {@spell vampirice touch}, {@spell water breathing}, {@spell water walk}"
									],
									[
										"4th",
										"{@spell charm monster|XGE}, {@spell death ward}, {@spell fire shield}, {@spell freedom of movement}, {@spell greater invisibility}, {@spell stoneskin}"
									],
									[
										"5th",
										"{@spell awaken}, {@spell commune with nature}, {@spell contact other plane}, {@spell dominate person}, {@spell greater restoration}, {@spell legend lore}, {@spell reincarnate}, {@spell skill empowerment}"
									],
									[
										"6th",
										"{@spell curse of craving|WH}, {@spell find the path}, {@spell investiture of flame|XGE}, {@spell investiture of ice|XGE}, {@spell investiture of stone|XGE}, {@spell investiture of wind|XGE}, {@spell true seeing}"
									]
								]
							},
							"Immediately choose any details this spell would have you select and expend that spell’s material components and a spell slot equal to the spell level you intend the spell to function at. Instead of any targets specified by the spell, the spell’s target becomes the creature that drinks the potion. If a creature must have certain attributes to be subject to the spell (such as a specific creature type), the potion only works on creatures with those attributes.",
							"At the end of the rest, you then create a potion that is able to impart the spell you selected, with the details you have chosen. The spell slot you have used in the creation of the potion does not refresh as long as the potion exists. Once the potion (or an item it is applied to) has been used, is destroyed, or otherwise ceases to exist, the spell slot can refresh as it would normally, but does not automatically do so.",
							{
								"type": "entries",
								"name": "Using an Imbued Potion",
								"entries": ["As an action, a creature can drink the entire potion, administer it to another willing creature, or apply it to an item of food or drink. The potion only confers effects on a creature that drinks it entirely, or that consumes in entirety the item of food or drink to which it is applied. Such a creature immediately gains the effects of the spell you selected, with the specific details you chose when you first created the potion. An applied potion on a consumable item can be detected by a creature holding the item with a successful Intelligence (Arcana) or Wisdom (Survival) check made against your spell save DC. Spells imparted by this potion last for their normal durations, listed within the text of the spells themselves. If a spell conferred by this feature requires concentration, the creature that drank the potion must maintain concentration on the effect as if they cast the spell themselves. If a potion would require the creature drinking it to make a saving throw, that saving throw is made against your spell save DC."]
							},
							{
								"type": "entries",
								"name": "Active Potions",
								"entries": ["At any time, you can have a number of active potions from this feature equal to your witch level divided by 3, rounded down. You can also cause any of your potions from this feature to no longer retain their potency with a bonus action, regardless of how far away from you they may be."]
							}
						]
					}
				],
				[{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 4th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}],
				[{
					"name": "Jinx (2/rest)",
					"entries": [
						"At 5th level, you can use your jinx feature twice before needing to rest."
					]
				}],
				[{
					"name": "Witch's Coven feature",
					"entries": [
						"At 6th level, you gain a feature granted by your Witch's Coven."
					],
					"gainSubclassFeature": true
				}],
				[{
					"name": "Enchant Broom",
					"entries": [
						"At 7th level, you’ve learned the secret ritual required to make a witch’s broom, the flying conveyance of any true witch. You can undertake an hourlong ritual that prepares one broom (or, with your DM’s permission, any sufficiently broomlike object) to become your witch’s broom. After this ritual is complete, this broom counts as a broom of flying (Dungeon Master’s Guide, p. 156), and you choose the command word needed to activate it. This broom responds only to your use of its command word, and will refuse to move if anyone else tries to ride it while you are not already on it. The broom is still able to move about unoccupied as normal, however.",
						"If you perform this ritual on a second broom while you already have a witch’s broom benefiting from this feature, the first witch’s broom returns to its initial mundane state, and the new broom becomes your witch’s broom."
					]
				}],
				[{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 8th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}],
				[],
				[{
					"name": "Witch's Coven feature",
					"entries": [
						"At 10th level, you gain a feature granted by your Witch's Coven."
					],
					"gainSubclassFeature": true
				}],
				[{
					"name": "Fine Fettle",
					"entries": [
						"At 11th level, you are perpetually healthy and resistant to conditions that could be the death of others. You have resistance to poison damage and are immune to disease and the poisoned condition.",
						"Additionally, you age only 1 year for every 5 years you grow older, are immune to the negative effects of aging, and cannot unwillingly die from old age."
					]
				}],
				[{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 12th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}],
				[],
				[{
					"name": "Witch's Coven feature",
					"entries": [
						"At 14th level, you gain a feature granted by your Witch's Coven."
					],
					"gainSubclassFeature": true
				}],
				[{
					"name": "Jinx (3/rest)",
					"entries": [
						"At 15th level, you can use your jinx feature three times before needing to rest."
					]
				}],
				[{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 16th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}],
				[],
				[],
				[{
					"name": "Ability Score Improvement",
					"entries": [
						"When you reach 19th level you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
						"If your DM allows the use of feats, you may instead take a feat."
					]
				}],
				[{
					"name": "Grand Old Wytch",
					"entries": [
						"Once you reach 20th level, you have been honored with the title of Grand Olde Wytch, bestowed on only the greatest practitioners of witchcraft.",
						"After you roll initiative, you can choose to be able to use your Jinx feature freely for the next one minute without expending any of its uses. All other restrictions on using Jinx still apply."
					]
				}]
			],
			"subclassTitle": "Witch's Coven",
			"subclasses": [{
				"name": "Coven of the Lost Moon",
				"subclassFeatures": [
					[{
						"name": "P",
						"entries": [
							"P"
						]
					}],
					[{
						"type": "entries",
						"name": "P",
						"entries": [
							"P"
						]
					}],
					[{
						"type": "entries",
						"name": "P",
						"entries": [
							"P"
						]
					}],
					[{
						"type": "entries",
						"name": "P",
						"entries": [
							"P"
						]
					}]
				],
				"source": "walrockwitch",
				"shortName": "Lost Moon"
			}],
			"fluff": [{
				"entries": [
					"Witches are learned practitioners of the earliest of magics, from a time when the arcane and the natural were studied as one. Eschewing the more esoteric magics studied by some of their peers, witches prefer practical magic with a variety of potential uses. Witches draw upon the power inherent in the night and the land to breathe life into fallen comrades, brew mystical potions and poisons mighty enough to fell a dragon, and weave terrible curses that may plague an individual for the rest of their life."
				],
				"name": "Witch",
				"type": "section"
			}],
			"classSpells": [
				"Acid Splash",
				"Chill Touch",
				{
					"name": "Control Flames",
					"source": "XGE"
				},
				{
					"name": "Create Bonfire",
					"source": "XGE"
				},
				"Dancing Lights",
				"Druidcraft",
				"Friends",
				{
					"name": "Frostbite",
					"source": "XGE"
				},
				"Guidance",
				{
					"name": "Gust",
					"source": "XGE"
				},
				{
					"name": "Infestation",
					"source": "XGE"
				},
				"Mage Hand",
				{
					"name": "Magic Stone",
					"source": "XGE"
				},
				"Mending",
				"Message",
				"Minor Illusion",
				{
					"name": "Mold Earth",
					"source": "XGE"
				},
				"Poison Spray",
				"Prestidigitation",
				{
					"name": "Primal Savagery",
					"source": "XGE"
				},
				"Produce Flame",
				"Ray of Frost",
				{
					"name": "Shape Water",
					"source": "XGE"
				},
				"Spare the Dying",
				"Thaumaturgy",
				"Thorn Whip",
				{
					"name": "Toll the Dead",
					"source": "XGE"
				},
				{
					"name": "Watch Totem",
					"source": "WH"
				},
				"Alarm",
				"Animal Friendship",
				{
					"name": "Animate Hair",
					"source": "WH"
				},
				{
					"name": "Beast Bond",
					"source": "XGE"
				},
				{
					"name": "Cackle",
					"source": "WH"
				},
				{
					"name": "Catapult",
					"source": "XGE"
				},
				{
					"name": "Cause Fear",
					"source": "XGE"
				},
				"Charm Person",
				"Command",
				"Comprehend Languages",
				"Create or Destroy Water",
				"Detect Evil and Good",
				"Detect Magic",
				"Detect Poison and Disease",
				{
					"name": "Distort Value",
					"source": "AI"
				},
				{
					"name": "Earth Tremor",
					"source": "XGE"
				},
				"Entangle",
				"Faerie Fire",
				"Feather Fall",
				"Fog Cloud",
				"Goodberry",
				{
					"name": "Guiding Light",
					"source": "WH"
				},
				{
					"name": "Ice Knife",
					"source": "XGE"
				},
				"Identify",
				"Illusory Script",
				"Mage Armor",
				"Protection from Evil and Good",
				"Purify Food and Drink",
				"Ray of Sickness",
				{
					"name": "Rite",
					"source": "WH"
				},
				"Sleep",
				{
					"name": "Snare",
					"source": "XGE"
				},
				"Speak with Animals",
				"Unseen Servant",
				"Witch Bolt",
				"Alter Self",
				"Animal Messenger",
				"Augury",
				"Barkskin",
				"Beast Sense",
				"Detect Thoughts",
				{
					"name": "Dragon's Breath",
					"source": "XGE"
				},
				{
					"name": "Dust Devil",
					"source": "XGE"
				}, {
					"name": "Earthbind",
					"source": "XGE"
				},
				"Enhance Ability",
				"Enlarge/Reduce",
				"Enthrall",
				"Gentle Repose",
				"Gust of Wind",
				"Hold Person",
				"Invisibility",
				"Knock",
				"Locate Animals or Plants",
				"Locate Object",
				"Magic Mouth",
				"Melf's Acid Arrow",
				"Misty Step",
				"Moonbeam",
				"Nystul's Magic Aura",
				"Protection from Poison",
				"Ray of Enfeeblement",
				"See Invisibility",
				"Silence",
				{
					"name": "Skywrite",
					"source": "XGE"
				},
				{
					"name": "Snilloc's Snowball Swarm",
					"source": "XGE"
				},
				"Spider Climb",
				"Spike Growth",
				"Suggestion",
				{
					"name": "Warding Wind",
					"source": "XGE"
				},
				"Web",
				"Zone of Truth",
				{
					"name": "Catnap",
					"source": "XGE"
				},
				"Clairvoyance",
				"Conjure Animals",
				{
					"name": "Conjure Effigy",
					"source": "WH"
				},
				"Counterspell",
				"Create Food and Water",
				"Dispel Magic",
				{
					"name": "Enemies Abound",
					"source": "XGE"
				},
				{
					"name": "Enlarge Familiar",
					"source": "WH"
				},
				"Erupting Earth",
				{
					"name": "Fast Friends",
					"source": "AI"
				},
				"Fear",
				"Feign Death",
				"Gaseous Form",
				"Glyph of Warding",
				{
					"name": "Incite Greed",
					"source": "AI"
				},
				"Leomund's Tiny Hunt",
				"Life Transference",
				"Magic Circle",
				"Meld into Stone",
				"Nondetection",
				"Phantom Steed",
				"Plant Growth",
				"Sending",
				"Sleet Storm",
				"Slow",
				"Speak with Dead",
				"Speak with Plants",
				"Stinking Cloud",
				"Tidal Wave",
				{
					"name": "Tiny Servant",
					"source": "XGE"
				},
				"Tongues",
				"Vampiric Touch",
				"Water Breathing",
				"Water Walk",
				"Arcane Eye",
				"Banishment",
				{
				"name": "Charm Monster",
				"source": "XGE"
				},
				"Compulsion",
				"Confusion",
				"Conjure Minor Elementals",
				"Conjure Woodland Beings",
				"Control Water",
				"Dominate Beast",
				"Fabricate",
				"Freedom of Movement",
				{
					"name": "Galder's Speedy Courier",
					"source": "LLK"
				},
				"Giant Insect",
				"Grasping Vine",
				{
					"name": "Guardian of Nature",
					"source": "XGE"
				},
				"Ice Storm",
				"Locate Creature",
				"Polymorph",
				{
					"name": "Share Pain",
					"source": "WH"
				},
				"Stone Shape",
				"Animate Objects",
				"Awaken",
				{
					"name": "Combine Potions",
					"source": "WH"
				},
				"Commune with Nature",
				"Conjure Elemental",
				"Contact Other Plane",
				{
					"name": "Control Winds",
					"source": "XGE"
				},
				"Dominate Person",
				"Dream",
				"Geas",
				{
					"name": "Glyph of Misfortune",
					"source": "WH"
				},
				"Hallow",
				"Hold Monster",
				"Legend Lore",
				"Modify Memory",
				"Passwall",
				"Planar Binding",
				"Reincarnate",
				"Scrying",
				{
					"name": "Skill Empowerment",
					"source": "XGE"
				},
				"Telekinesis",
				"Teleportation Circle",
				"Transmute Rock",
				"Tree Stride",
				"Wall of Stone",
				{
					"name": "Wrath of Nature",
					"source": "XGE"
				},
				{
					"name": "Animate Hut",
					"source": "WH"
				},
				{
					"name": "Bones of the Earth",
					"source": "XGE"
				},
				"Circle of Death",
				"Conjure Fey",
				{
					"name": "Create Homunculus",
					"source": "XGE"
				},
				"Create Undead",
				{
					"name": "Curse of Craving",
					"source": "WH"
				},
				"Eyebite",
				"Find the Path",
				"Flesh to Stone",
				"Guards and Wards",
				{
					"name": "Investiture of Flame",
					"source": "XGE"
				},
				{
					"name": "Investiture of Ice",
					"source": "XGE"
				},
				{
					"name": "Investiture of Stone",
					"source": "XGE"
				},
				{
					"name": "Investiture of Wind",
					"source": "XGE"
				},
				"Magic Jar",
				"Mass Suggestion",
				{
					"name": "Mental Prison",
					"source": "XGE"
				},
				"Move Earth",
				"Otto's Irresistible Dance",
				"Planar Ally",
				{
					"name": "Soul Cage",
					"source": "XGE"
				},
				"Transport via Plants",
				"True Seeing",
				"Wall of Thorns",
				"Etherealness",
				"Finger of Death",
				"Forcecage",
				"Mirage Arcane",
				"Plane Shift",
				{
					"name": "Power Word Pain",
					"source": "XGE"
				},
				"Project Image",
				"Sequester",
				"Simulacrum",
				"Symbol",
				{
					"name": "Whirlwind",
					"source": "XGE"
				},
				{
					"name": "Abi-Dalzim's Horrid Wilting",
					"source": "XGE"
				},
				"Animal Shapes",
				"Antimagic Field",
				"Antipathy/Sympathy",
				"Control Weather",
				"Dominate Monster",
				"Earthquake",
				"Feeblemind",
				{
				"name": "Illusory Dragon",
				"source": "XGE"
			},
			{
				"name": "Maddening Darkness",
				"source": "XGE"
			},
			"Mind Blank",
			"Power Word Stun",
			"Astral Projection",
			"Foresight",
			"Gate",
			"Imprisonment",
			{
				"name": "Mass Polymorph",
				"source": "XGE"
			},
			"Power Word Kill",
			"Psychic Scream",
			"Shapechange",
			"Storm of Vengeance",
			"True Polymorph",
			"Weird"
	]
}
],
	"optionalfeature": [
		{
			"source": "WH",
			"name": "Beguiling",
			"entries": [
				"Pull the creature 15 feet towards you in a straight line. This movement does not provoke opportunity attacks."
				],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Crippling",
			"entries": [
				"The creature’s movement speeds are reduced by 20 feet."
				],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Draining",
			"entries": [
				"The creature cannot regain hit points."
				],
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Witch"
						}
					}
				}
			],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Dulled Reflexes",
			"entries": [
				"The creature cannot take opportunity attacks."
				],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Fumbling",
			"entries": [
				"The creature drops one item of your choice that it is holding. The item lands at the creature's feet."
				],
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Witch"
						}
					}
				}
			],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Misfortune",
			"entries": [
				"The next attack the creature makes is made with disadvantage."
				],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Repelling",
			"entries": [
				"Push the creature 15 feet directly away from you in a straight line. This movement does not provoke opportunity attacks."
				],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Silenced",
			"entries": [
				"The creature cannot talk and is unable to cast spells."
				],
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Witch"
						}
					}
				}
			],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Supplication",
			"entries": [
				"The creature must make a Strength saving throw against your spell save DC. If it fails, it becomes prone, and can recover from this condition as normal."
				],
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Witch"
						}
					}
				}
			],
			"featureType": "Jinx"
		},
		{
			"source": "WH",
			"name": "Wytchfire",
			"entries": [
				"The creature casts dim light in a 10-foot radius. The next attack made against the creature has advantage."
				],
			"featureType": "Jinx"
		}],
		"spell": [
		{
			"name": "Animate Hair",
			"source": "walrockwitch",
			"page": 24,
			"srd": true,
			"level": 1,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "bonus"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"s": true,
				"m": "a silver comb"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1,
						"upTo": true
					},
					"concentration": true
				}
			],
			"entries": [
				"Your hair grows to a length of five feet and begins to undulate, forming four large, living tendrils. While under the effects of this spell, you can use your hair to make attacks or lift small items. Items lifted by your hair can weigh collectively up to 20 pounds, or up to four objects (one per tendril) of 5 pounds or lighter. You are able to manipulate these objects with your hair as you would your hands, unless otherwise specified.",
				"You can attack with your hair by making a melee spell attack using the Attack action, and your hair is considered to have a reach of 10 feet. On a hit, your hair deals bludgeoning damage equal to {@dice 1d8} + your spellcasting ability modifier.",
				"You can also use your hair to perform a grapple against any creature within its reach. Use a check with your spellcasting ability modifier in place of any Strength (Athletics) checks the grapple would have you make. Your hair can grapple up to four creatures separately, as each tendril counts as an open hand for this purpose.",
				"Your hair can hold weapons and shields as it would any other item, but cannot use them to make attacks or confer any bonuses. Your hair does not innately grant you any extra attacks, but if you have the Extra Attack feature (or similar) you can make your normal assortment of additional attacks using your hair.",
				"When this spell ends, your hair resumes its previous length and appearance, and drops any objects or creatures it may be holding."
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"damageInflict": [
				"bludgeoning"
			],
			"savingThrow": [
				"dexterity"
			],
			"miscTags": [
				"SCL",
				"SGT"
			],
			"areaTags": [
				"ST",
				"MT"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					}
				]
			},
			"uniqueId": "342dffc8ae12f684af214e565bb7a560"
		},
		{
			"name": "Animate Hut",
			"source": "walrockwitch",
			"page": 25,
			"srd": true,
			"level": 6,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "hour"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "touch"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": {
					"text": "a chicken foot, 500 gp of herbs which the spell consumes",
					"consumed": true,
					"cost": 50000
				}
			},
			"duration": [
				{
					"type": "permanent"
				}
			],
			"entries": [
				"You can animate a hovel, hut, or small house that you touch as part of the casting of this spell, causing it to grow two to eight legs that can be organic or inorganic in appearance.",
				"This animated hut is a construct immune to disease, poison damage, and being frightened, poisoned, or charmed, and has an AC of 16, 100 hit points, a speed of 50 feet, 26 Strength, 12 Dexterity, 18 Constitution, a 4 in all other statistics, and is considered to be Gargantuan in size. If the owner of this hut does not consent to this spell taking place, the spell slot will be expended with no effect. If the hut is reduced to 0 hit points, it returns to its inanimate state, but may suffer some structural damage in doing so.",
				"While you are within this hut, you can expend an action to cause the hut to move in a direction of your choice. As a part of this action, you can cause the hut to take either the Dash or Dodge action. If you are not within the hut but on the same plane as it, you can call it to move to you (taking the Dash action) as a continuous ritual that lasts until the hut arrives, which requires you to stay within the same location for the ritual’s duration",
				"In either case, the hut is semi-intelligent and will avoid obvious pitfalls and hazardous terrain. If the hut cannot find a way forward (if it is too large for a path, for example), you instinctively know that something is blocking it. The hut is unable to attack, and will actively avoid harming creatures or destroying terrain in the course of its movement.",
				"If you cast this spell while you already have an animated hut, the first hut returns to its inanimate state, and the new hut becomes your animated hut."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 9th level, you can instead cause the hut to grow wings and fly, granting it a flying speed of 100 feet with the hover quality instead of its normal movement speed."
					]
				}
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"savingThrow": [
				"dexterity"
			],
			"miscTags": [
				"PRM",
				"SCL",
				"SMN"
			],
			"areaTags": [
				"ST"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					}
				]
			},
			"uniqueId": "448872f6c0e670437e861b12d9788c96"
		},
		{
			"name": "Cackle",
			"source": "walrockwitch",
			"page": 25,
			"srd": true,
			"level": 1,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 15
				}
			},
			"components": {
				"v": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "round",
						"amount": 1
					}
				}
			],
			"entries": [
				"You elicit a wicked cackle, unnerving to those nearby. Each creature within range cannot target you with opportunity attacks for the duration, and must make a Wisdom saving throw. A creature that fails this saving throw takes {@damage 3d4} psychic damage."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 2nd level or higher, increase the psychic damage by {@dice 1d4} for each slot level above 1st."
					]
				}
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"damageInflict": [
				"psychic"
			],
			"savingThrow": [
				"wisdom"
			],
			"miscTags": [
				"SCL"
			],
			"areaTags": [
				"MT"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					}
				]
			},
			"uniqueId": "f3114d7771bc3332c046fa3248832a81"
		},
		{
			"name": "Combine Potions",
			"source": "walrockwitch",
			"page": 25,
			"srd": true,
			"level": 5,
			"school": "T",
			"time": [
				{
					"number": 10,
					"unit": "minute"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "touch"
				}
			},
			"components": {
				"s": true,
				"m": "alchemist's supplies, two vials or bottles of potions or poison"
			},
			"duration": [
				{
					"type": "permanent"
				}
			],
			"entries": [
				"You attempt to combine two potions or poisons you have on your person into a single item with the effects of both. The potions or poisons you’re combining can be mundane, magical, or created with class features that allow the imbuing of spells (as with the Witch’s Imbue Potion feature). You cannot combine two potions that were created with features that imbue spells, nor can you combine a previously combined potion or poison with any other item.",
				"After casting this spell, make two checks with your spellcasting ability modifier, adding your proficiency bonus if you are proficient with alchemist’s supplies. The DC for these checks is 25 – twice the level of the spell slot you used to cast this spell. On a success, you have created the combined potion or poison, and both of the new item’s effects can be applied with a single Use an Object action.",
				"If this check fails, however, one of the items you attempted to combine is destroyed, chosen at random. Further, roll once on the Potion Mishaps table, and suffer the result.",
				"Potion Mishaps",
				"{@dice d10} Revelation",
				"1 The potion fumes turn your skin green. Only a remove curse spell can end this effect.",
				"2 A large, unsightly wart grows in a prominent position on your body.",
				"3 The destroyed potion explodes, catching you on fire and dealing {@damage 1d6} fire damage each turn until you use an action to render yourself prone and put it out.",
				"4 The potion releases a toxic miasma, as if you had cast the spell stinking cloud centered on yourself.",
				"5 Roll {@dice 1d100}. This is the percentage of your hair that falls out.",
				"6 The potion ignites in a loud flash and an explosive bang. You are blinded and deafened for one minute.",
				"7 Smoke from the potion deadens your senses. Everything smells and tastes like dirt for 24 hours.",
				"8 The potion’s fumes cloud your mind, and you forget all events that happened within the last hour.",
				"9 Within 20 feet of you, all plants wilt and die, and all food and milk spoils.",
				"10 One randomly determined item on your person is transported to the Ethereal Plane."
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"miscTags": [
				"PRM"
			],
			"areaTags": [
				"MT"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Artificer",
						"source": "ERLW"
					}
				]
			},
			"uniqueId": "857ac779743db8c5449fecc155a974a5"
		},
		{
			"name": "Conjure Effigy",
			"source": "walrockwitch",
			"page": 26,
			"srd": true,
			"level": 3,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": {
					"text": "a personal item belonging to the target with sentimental value, or a piece of the target’s body such as their hair or nail clippings, which the spell consumes",
					"consumed": true
				}
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"entries": [
				"Choosing one creature you can see within 120 feet of you, you conjure in an unoccupied hand a makeshift doll of linen, straw, and stuffing that vaguely resembles the target, binding the personal item used in the spell’s casting to the doll. If you lack the material component for this spell and the target is within 5 feet of you, you can retrieve an inconsequential personal item (such as a hair) from the target as part of this spell’s casting, which you immediately use as the spell’s material component. ",
				"While you hold this doll, damage you inflict upon it harms the creature that the doll resembles. Damage done with this doll cannot kill a creature, and if a creature is reduced to 0 hit points through usage of this doll, it is rendered unconscious but is immediately stabilized. After the spell’s duration expires, the doll vanishes, and any personal items lose their magical potency and cannot be reused.",
				"As part of the action used to conjure the doll, or as a separate action on a later turn while you are holding the doll, you can perform any of the following:",
				"Pinprick. You pull out a short pin and stab the doll. Make a spell attack roll against the creature the doll resembles. On a hit, it takes {@damage 3d8} piercing damage.",
				"Open Flame. You expose the doll to fire, burning it. The creature the resembles must make a Charisma saving throw. If it fails, it takes {@damage 5d8} fire damage. If the target succeeds on its saving throw, it takes half this amount. In either case, this destroys the doll, and the spell ends.",
				"Throw. You throw the doll up to 10 feet in a direction you choose. The creature it resembles must make a Charisma saving throw. If it fails, it is moved 10 feet in a direction of your choice other than upwards for every 5 feet you threw the doll. If the creature fails the save and if it or the doll collide with any solid objects (other than the floor) during this throw or forced movement, the creature takes {@damage 2d8} bludgeoning damage.",
				"Crush. You throw the doll to the ground and stomp on it. The creature it resembles must make a Charisma saving throw. If it fails, it is rendered prone and takes {@damage 2d8} bludgeoning damage."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 4th level or higher, any damage dealt by the spell increases by {@dice 1d8} for each slot level above 3rd."
					]
				}
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"damageInflict": [
				"bludgeoning",
				"fire",
				"piercing"
			],
			"miscTags": [
				"SGT",
				"SCL"
			],
			"areaTags": [
				"ST"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "1804d6f080e8113a4d772bab8dc1902e"
		},
		{
			"name": "Curse of Craving",
			"source": "walrockwitch",
			"page": 27,
			"srd": true,
			"level": 6,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "touch"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a dinnerbone picked clean of meat"
			},
			"duration": [
				{
					"type": "permanent"
				}
			],
			"entries": [
				"You touch one humanoid, which must make a Charisma saving throw. If it fails, the target suffers your choice of one of the following curses, which can be negated with a remove curse spell or similar magic.",
				"Adoration. The target develops a deep admiration for a creature of your choice, which you must have seen and that knows at least one language. The creature you choose can be yourself. The target is considered charmed by that creature. When the target takes a long rest, it can repeat the initial saving throw, ending this effect on a success. ",
				"Starvation. The target has either an unending hunger or thirst (your choice) that no amount of food or water will satiate. At the end of the day (typically after a long rest), the target suffers the effects of food or water deprivation, as listed in the Player’s Handbook (p. 185), as if it had consumed no food or water that day. This effect only functions if the target needs to eat food or drink water to survive. Each day after suffering deprivation in this way, the target may repeat the initial saving throw. If it succeeds, this effect ends, though the target still suffers the effects of food or water deprivation until they are mitigated normally."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 4th level or higher, any damage dealt by the spell increases by {@dice 1d8} for each slot level above 3rd."
					]
				}
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"miscTags": [
				"PRM"
			],
			"areaTags": [
				"ST"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "c3ccd8e309c00d91ddb65693af312cdc"
		},
		{
			"name": "Enlarge Familiar",
			"source": "walrockwitch",
			"page": 27,
			"srd": true,
			"level": 3,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "bonus"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 120
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a magnifying glass"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					}
				}
			],
			"entries": [
				"This spell can only target a familiar you have summoned through the find familiar spell. You use your magic to increase your familiar’s size and strength dramatically, making them a much more formidable foe. Your familiar grows to Medium size, gains an AC of 8 + your proficiency bonus + your spellcasting ability modifier, and it increases its hit point maximum by 10. The Strength, Dexterity, and Constitution scores of your familiar all increase to 10 (unless they are greater already), and you choose one of these scores to instead increase to 14.",
				"Your familiar also gains an attack which adds your spellcasting ability modifier and proficiency bonus to its roll to hit (in place of the familiar’s own statistics), and on a hit deals piercing, bludgeoning, or slashing damage (your choice) equal to {@dice 1d8} + your spellcasting ability modifier. Your familiar still cannot attack on its own, and you must use a bonus action to allow it to use an Attack action, or use a reaction of your own to allow it to make an opportunity attack.",
				"This transformation lasts for up to one minute, until your familiar is reduced to 0 hit points, or until you end it as no additional action."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 5th level or higher, your familiar instead grows to Large size, and increases its hit point maximum by an additional 5 hit points for every slot level above 3rd."
					]
				}
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"miscTags": [
				"SGT",
				"SCL"
			],
			"areaTags": [
				"ST"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "f1287f45768de21bbd146ce2951e1552"
		},
		{
			"name": "Glyph of Misfortune",
			"source": "walrockwitch",
			"page": 27,
			"srd": true,
			"level": 5,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 30
				}
			},
			"components": {
				"s": true,
				"m": "a drawn glyph"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"entries": [
				"You impart a vicious curse, draining a creature’s luck. Choose one creature you can see within range, which must make a Charisma saving throw. If it fails, that crea- ture is subject to your glyph of misfortune for the spell’s duration, or until the creature is affected by remove curse or similar magic.",
				"Whenever a creature under your glyph makes an attack, an ability check, or a saving throw, you inherently know, and you can use your reaction to roll {@dice 1d20} after you know the result of the creature’s roll. If your result is lower than the creature’s roll, substitute the number on your die for what the creature rolled."
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"savingThrow": [
				"charisma"
			],
			"miscTags": [
				"SGT"
			],
			"areaTags": [
				"ST"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "4e8ed6c1603835c1bb7a5777ed666a87"
		},
		{
			"name": "Guiding Light",
			"source": "walrockwitch",
			"page": 28,
			"srd": true,
			"level": 1,
			"school": "I",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"s": true,
				"m": "a silver mirror"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You create a luminous beacon over your head that shines with the radiance of the moon. Any number of creatures you designate up to your spellcasting ability modifier (minimum 1) within 30 feet of you can use a reaction to immediately move a distance up to its movement speed closer to you. This movement does not provoke opportunity attacks."
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"areaTags": [
				"MT"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Druid",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					},
					{
						"name": "Ranger",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "97d00665452a97afcfb067b6163493ca"
		},
		{
			"name": "Rite",
			"source": "walrockwitch",
			"page": 28,
			"srd": true,
			"level": 1,
			"school": "A",
			"time": [
				{
					"number": 1,
					"unit": "hour"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "touch"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": {
					"text": "25 gp worth of incense and herbs, which the spell consumes",
					"consumed": true,
					"cost": 2500
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You undertake a magical rite, intended to denote a time of change in life. When you cast this spell, choose one of the following effects, the targets of which must remain within 10 feet of you during casting.",
				"Coming of Age. You touch one willing young adult humanoid, who then chooses 3 skills. For the next 24 hours, the target is proficient in those 3 skills if they are not already, and has advantage on checks made with the chosen skills. A creature can only benefit from this once.",
				"Funeral. You touch the corpse of one creature. For the next 7 days, the creature cannot be made undead by any means, aside from a wish spell.",
				"Hunt. You touch up to 5 humanoids, which can include yourself. For the next 24 hours, beasts have disadvantage on any Perception checks to locate a creature affected by this rite, and a creature under this rite has advantage on any Survival checks made to locate a beast.",
				"Induction. You touch one willing humanoid who wishes to become a member of your circle or coven. For the next 24 hours, that creature has advantage on Insight checks and Wisdom and Intelligence saving throws, as long as at least one member of your circle or coven is within 30 feet of them. A creature can only benefit from this once.",
				"Sacrifice. You touch one creature with a CR or level less than your total character level. This creature cannot be a construct or undead, and must be conscious and restrained or immobilized for the duration of the ritual. Upon completion of the ritual the creature dies, and you and up to 5 creatures you designate who were within 10 feet of the ritual during its casting gain temporary hit points equal to your spellcasting modifier + the creature’s CR or level, which last for up to 24 hours. A creature can only benefit from this once every 30 days. ",
				"Wedding. You touch a number of adult humanoids willing to be bonded in marriage. For the next 7 days, each of these creatures gains a point of inspiration whenever they spend a short or long rest in the company of at least one of their spouses. A creature cannot gain this benefit again for 300 days, nor can it be gained a second time by the same coupling of creatures."
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Druid",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "141b9c1469d824acd7d4b6bd87a78ce2"
		},
		{
			"name": "Share Pain",
			"source": "walrockwitch",
			"page": 29,
			"srd": true,
			"level": 4,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "reaction",
					"condition": "which you take when you or a creature you can see within 60 feet of you are hit by an attack made by a creature within range"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 60
				}
			},
			"components": {
				"m": "a thorned vine tied in a knot"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You attempt to transfer some of the triggering attack’s damage back to the attacking creature. Reduce the damage the creature hit with the attack receives by half (round up), and the attacking creature must make a Constitution saving throw. If it fails, it takes the same amount of damage received by the target of its attack, up to a maximum of 10 hit points of damage."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 5th level or higher, the maximum damage this spell can deal increases by 10 hit points for every slot level above 4th."
					]
				}
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"savingThrow": [
				"constitution"
			],
			"miscTags": [
				"SGT",
				"SCL"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					},
					{
						"name": "Ranger",
						"source": "PHB"
					},
					{
						"name": "Wizard",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "cfc7c59b206c2310bb3926e55b99a465"
		},
		{
			"name": "Watch Totem",
			"source": "walrockwitch",
			"page": 29,
			"srd": true,
			"level": 0,
			"school": "D",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 5
				}
			},
			"components": {
				"s": true,
				"m": "a tiny stick, stone, or other natural object carved with runes"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You place the object used as a material component of this spell on a horizontal surface within range. For the duration of this spell, as long as you are on the same plane as the object, you can use an action at any time to see from the object’s location for up to one minute. You can only see in a 60-foot radius around the object, your normal senses are considered blinded during this time, and this spell does not allow you to hear sounds near the object. Special vision-based senses you may have, such as darkvision, function normally with this spell.",
				"This vision ends after one minute, or if you take an action to end it early. After this vision ends, when the spell’s duration expires, if the object takes damage, or if the object is affected by dispel magic or similar, the object crumbles to dust and can no longer be used.",
				"Only one watch totem can be active at any time. Casting this spell while an object created by this spell already exists destroys that original object, allowing a newly-created object to function."
			],
			"scalingLevelDice": {
				"label": "acid damage",
				"scaling": {
					"1": "1d6",
					"5": "2d6",
					"11": "3d6",
					"17": "4d6"
				}
			},
			"savingThrow": [
				"constitution"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Witch",
						"source": "walrockwitch"
					},
					{
						"name": "Druid",
						"source": "PHB"
					}
				]
			},
			"uniqueId": "abf18bef6433767746ea1e4ddf3232bc"
		}
	]
}
